package files_input_output;

/**
 * @author annasavasteeva
 * @date 03.05.2026
 */
public class DocNumbersApp {

    public void runApp() {

//        Получить путь к файлу

//        Ппроверить путь на валидность (строка...): если невалиден, выбросить исключение

//        Проверить наличие файла по указанному пути: если нет, выбросить исключение

//        Открыть поток для вычитки файла

//        Проверять каждую строку на соответствие валидному номеру документа:
//        - если номер валиден, записать в соответствующий файл-отчет
//        - если номер невалиден, записать в другой файл-отчет и добавить информацию, почему он невалиден

//        Валидный номер:
//        - начинается с docnum или contract
//        - содержит только буквы и цифры
//        - длина == 15 символов
    }
}
